app/controllers/records_controller.rb

SELECT "records".* FROM "records"
---
  def index
    @records = Record.all

SELECT  "records".* FROM "records" WHERE "records"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @record = Record.find(params[:id])

SELECT  "records".* FROM "records" WHERE "records"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "records" SET "wins" = $1, "updated_at" = $2 WHERE "records"."id" = $3  [["wins", 6], ["updated_at", "2019-05-10 17:01:30.167518"], ["id", 1]]
---
  def update
    @record = Record.find(params[:id])
    @record.wins = params[:wins]
    @record.save